{
	"main": {
		"name": "Oliver  Mensah",
		"occupation": "Software Developer",
		"description": "He currently develops  Mobile apps(Android), Desktop, Web Applications as well as Web services and APIs. If he is not working on a software project, he is either writing technical articles, reading on software architecture and design or actively involved in building the tech ecosystem in Ghana.  He lives by the mantra; 'The best way to solidify your understanding of what you learn is by teaching it to others',",
		"bio": "Oliver now writes software at Agro Innova as a National Service Personnel. He is passionate about the people and technical aspect of the software industry. By 'people' he meant the developer community and by 'technical' he meant the whole design and implementation of technical decisions of software application.",
		"email": "olivermensah96@gmail.com",
		"image": "profilepic.jpg",
		"phone": "(+233)0544892841",
		"address": {
			"street": "Acheampong Junction, East Legon",
			"city": "Accra",
			"region": "Greater Accra",
			"country": "Ghana"
		},
		"website": "https://omensah.github.io",
		"resumedownload": "https://www.dropbox.com/s/d0dqiasms15ikzn/Main_resume.pdf?dl=0",
		"social": [{
				"name": "facebook",
				"url": "https://www.facebook.com/olivermensah.me",
				"className": "fa fa-facebook"
			},
			{
				"name": "twitter",
				"url": "https://twitter.com/Oliver_Mensah",
				"className": "fa fa-twitter"
			},
			{
				"name": "linkedin",
				"url": "https://gh.linkedin.com/in/olivermensah",
				"className": "fa fa-linkedin"
			},
			{
				"name": "github",
				"url": "https://github.com/OMENSAH",
				"className": "fa fa-github"
			},
			{
				"name": "skype",
				"url": "http://skype.com/omensah08",
				"className": "fa fa-skype"
			}
		]
	},
	"resume": {
		"education": [{
				"school": "Ashesi University College",
				"degree": "Bsc. Computer Science",
				"graduated": "June 2018",
				"description": "Ashesi's Computer Science programme focuses not only on software design and programming, but also on empowering young people to be at the forefront of African growth by harnessing the power of technology."
			},
			{
				"school": "Sefwi Bekwai Senior High School",
				"degree": "Agriculture Science(WASSCE)",
				"graduated": "May 2012",
				"description": ""
			}
		],
		"work": [
			{
				"company": "Agro Innova",
				"title": "National Service Personnel, Software Developer",
				"years": "August 2018 - Present",
				"description": "Writing Software that improves the agricultural space in Ghana. During my work at Agro Innova, I had developed a mobile application that was geared towards data collection of poultry farmers in Ghana. This project was in partnership between Agro Innova and Ghana National Association of Poultry Farmers."
			},
			{
				"company": "Auth0",
				"title": "Guest Author",
				"years": "March 2018 - Present",
				"description": "Writes tutorials on how to use software technologies to a wide audience. "
			},
			{
				"company": "Facebook",
				"title": "Facebook Developer Circle Accra, Co-Lead",
				"years": "August 2017 - Present",
				"description": "Developer Circles is a community-driven program that's free to join and open to coders, programmers, Software Developers, students, etc. Each Developer Circle is led by members of the local community who act as leads for the circle, organizing events offline and managing a local online Facebook community.  Developer Circles are forums to share knowledge, collaborate, build new ideas, and learn about the latest technologies from Facebook and other industry leaders.  As a Co-Lead,  he coordinates with Facebook on promoting the ecosystem of technology in Ghana, organize technology events like Meetups, Hackathons, train other developers on Facebook Technologies like React, React Native, etc"
			},
			{
				"company": "iSpace Foundation",
				"title": "Software Developer | Summer Intern",
				"years": "June 2016 - Sept 2016",
				"description": "worked with a team of 3 to develop a platform to help in data collation and analysis. We used Go to handle the backend"
			},
			{
				"company": "Cloud Port",
				"title": "Technical Officer || Summer Intern",
				"years": "June 2017 - Sept 2017",
				"description": "Worked with a team of 5 during my internship.  I was responsible for creating web services with Golang. Later, trained 3 newly interns on Golang, in order to contribute to the project we were working on."
			}
			
		],
		"skills": [
			{
				"name": "Polyglot(Work with any programming language - Just have to learn it)",
				"level": "100%"
			},
			{
				"name": "Problem Solving",
				"level": "100%"
			},
			{
				"name": "Algorithm Design and Analysis",
				"level": "90%"
			},
			{
				"name": "Software Design and Implementation",
				"level": "90%"
			},
			{
				"name": "Webservices Design and Implementation",
				"level": "80%"
			},
			{
				"name": "API Design and Documentation",
				"level": "70%"
			},
			{
				"name": "Desktop Development",
				"level": "70%"
			},
			{
				"name": "Web Development",
				"level": "70%"
			}
			,
			{
				"name": "Android Development with Java and Kotlin",
				"level": "80%"
			}			
		]
	},
	"portfolio": {
		"projects": [
			{
				"title":"The barePHP Framework",
				"description":"A mirocframework for building web application with PHP. barePHP focuses on MVC architectural pattern, design patterns like Registry to provide beginner friendly minimal approach to building PHP web application.",
				"category":"Software Engineering",
				"tags":"Framework, Web Design",
				"image":"barephp.png",
				"url":"https://github.com/OMENSAH/barePHP",
				"modal":"#modal-01"
			  },
			  {
				"title":"SyncCases",
				"description":"This was my class project. It was supposed to be completed in two so it has a lot more work to be done on it. SyncCases is an app that allows you users to be vigilante on our roads . Users report road users who do not adhere to rules on our roads. Users capture and report culprits to authorities and let the authorities handle the rest",
				"category":"Software Engineering",
				"tags":"Mobile, Android",
				"image":"synccases.png",
				"url":"https://play.google.com/store/apps/details?id=com.github.olivermensah.synccases",
				"modal":"#modal-02"
			  }
		]
	},
	"testimonials": {
		"testimonials": [
		{
			"text": "I  have programmed using PHP for more than 5 years but after the Facebook Developer Circles ReactJS workshop last weekend, i think Oliver Mensah has placed me on my path to developing with React.",
			"user": "Kweku Bright"
		},
		{
			"text": "Last Saturday at a Developer Circles from Facebook, Hands on React Js session with Oliver Mensah. Great stuff. Great teacher. Excited to learn more. I found the use of spread and rest operators are quite impressive.Can’t wait for the next meet up.",
			"user": "Christiana A. Asare"
		}
	]
	}
}
